test/ejemplos/Poiseuille_plano/laminar_pipe/case0/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    //default         cellMDLimited Gauss linear 1;

    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;
    //div(phi,U)      Gauss linearUpwind default;
    //div(phi,U)      Gauss vanLeer;
    //div(phi,U)      Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
    //default         Gauss linear limited 0.5;
    //default         Gauss linear limited 0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
    //default         limited 0.5;
    //default         limited 0;
}

// ************************************************************************* //
